MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAS169/mcu.h
#define _REFO5CON_ROSEL_POSITION                 0x00000000
#define _REFO5CON_ROSEL_MASK                     0x0000000F
#define _REFO5CON_ROSEL_LENGTH                   0x00000004

#define _REFO5CON_ACTIVE_POSITION                0x00000008
#define _REFO5CON_ACTIVE_MASK                    0x00000100
#define _REFO5CON_ACTIVE_LENGTH                  0x00000001

#define _REFO5CON_DIVSWEN_POSITION               0x00000009
#define _REFO5CON_DIVSWEN_MASK                   0x00000200
#define _REFO5CON_DIVSWEN_LENGTH                 0x00000001

#define _REFO5CON_RSLP_POSITION                  0x0000000B
#define _REFO5CON_RSLP_MASK                      0x00000800
#define _REFO5CON_RSLP_LENGTH                    0x00000001

#define _REFO5CON_OE_POSITION                    0x0000000C
#define _REFO5CON_OE_MASK                        0x00001000
#define _REFO5CON_OE_LENGTH                      0x00000001

#define _REFO5CON_SIDL_POSITION                  0x0000000D
#define _REFO5CON_SIDL_MASK                      0x00002000
#define _REFO5CON_SIDL_LENGTH                    0x00000001

#define _REFO5CON_ON_POSITION                    0x0000000F
#define _REFO5CON_ON_MASK                        0x00008000
#define _REFO5CON_ON_LENGTH                      0x00000001

#define _REFO5CON_RODIV_POSITION                 0x00000010
#define _REFO5CON_RODIV_MASK                     0x7FFF0000
#define _REFO5CON_RODIV_LENGTH                   0x0000000F

#define _REFO5TRIM_ROTRIM_POSITION               0x00000017
#define _REFO5TRIM_ROTRIM_MASK                   0xFF800000
#define _REFO5TRIM_ROTRIM_LENGTH                 0x00000009

#define _PB1DIV_PBDIV_POSITION                   0x00000000
#define _PB1DIV_PBDIV_MASK                       0x0000007F
#define _PB1DIV_PBDIV_LENGTH                     0x00000007

#define _PB1DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB1DIV_PBDIVRDY_MASK                    0x00000800
#define _PB1DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB2DIV_PBDIV_POSITION                   0x00000000
#define _PB2DIV_PBDIV_MASK                       0x0000007F
#define _PB2DIV_PBDIV_LENGTH                     0x00000007

#define _PB2DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB2DIV_PBDIVRDY_MASK                    0x00000800
#define _PB2DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB2DIV_ON_POSITION                      0x0000000F
#define _PB2DIV_ON_MASK                          0x00008000
#define _PB2DIV_ON_LENGTH                        0x00000001

#define _PB3DIV_PBDIV_POSITION                   0x00000000
#define _PB3DIV_PBDIV_MASK                       0x0000007F
#define _PB3DIV_PBDIV_LENGTH                     0x00000007

#define _PB3DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB3DIV_PBDIVRDY_MASK                    0x00000800
#define _PB3DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB3DIV_ON_POSITION                      0x0000000F
#define _PB3DIV_ON_MASK                          0x00008000
#define _PB3DIV_ON_LENGTH                        0x00000001

#define _PB4DIV_PBDIV_POSITION                   0x00000000
#define _PB4DIV_PBDIV_MASK                       0x0000007F
#define _PB4DIV_PBDIV_LENGTH                     0x00000007

#define _PB4DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB4DIV_PBDIVRDY_MASK                    0x00000800
#define _PB4DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB4DIV_ON_POSITION                      0x0000000F
#define _PB4DIV_ON_MASK                          0x00008000
#define _PB4DIV_ON_LENGTH                        0x00000001

#define _PB5DIV_PBDIV_POSITION                   0x00000000
#define _PB5DIV_PBDIV_MASK                       0x0000007F
#define _PB5DIV_PBDIV_LENGTH                     0x00000007

#define _PB5DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB5DIV_PBDIVRDY_MASK                    0x00000800
#define _PB5DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB5DIV_ON_POSITION                      0x0000000F
#define _PB5DIV_ON_MASK                          0x00008000
#define _PB5DIV_ON_LENGTH                        0x00000001

#define _PB6DIV_PBDIV_POSITION                   0x00000000
#define _PB6DIV_PBDIV_MASK                       0x0000007F
#define _PB6DIV_PBDIV_LENGTH                     0x00000007

#define _PB6DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB6DIV_PBDIVRDY_MASK                    0x00000800
#define _PB6DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB6DIV_ON_POSITION                      0x0000000F
#define _PB6DIV_ON_MASK                          0x00008000
#define _PB6DIV_ON_LENGTH                        0x00000001

#define _PB7DIV_PBDIV_POSITION                   0x00000000
#define _PB7DIV_PBDIV_MASK                       0x0000007F
#define _PB7DIV_PBDIV_LENGTH                     0x00000007

#define _PB7DIV_PBDIVRDY_POSITION                0x0000000B
#define _PB7DIV_PBDIVRDY_MASK                    0x00000800
#define _PB7DIV_PBDIVRDY_LENGTH                  0x00000001

#define _PB7DIV_ON_POSITION                      0x0000000F
#define _PB7DIV_ON_MASK                          0x00008000
#define _PB7DIV_ON_LENGTH                        0x00000001

#define _SLEWCON_BUSY_POSITION                   0x00000000
#define _SLEWCON_BUSY_MASK                       0x00000001
#define _SLEWCON_BUSY_LENGTH                     0x00000001

#define _SLEWCON_DNEN_POSITION                   0x00000001
#define _SLEWCON_DNEN_MASK                       0x00000002
#define _SLEWCON_DNEN_LENGTH                     0x00000001

#define _SLEWCON_UPEN_POSITION                   0x00000002
#define _SLEWCON_UPEN_MASK                       0x00000004
#define _SLEWCON_UPEN_LENGTH                     0x00000001

#define _SLEWCON_SLWDIV_POSITION                 0x00000008
#define _SLEWCON_SLWDIV_MASK                     0x00000700
#define _SLEWCON_SLWDIV_LENGTH                   0x00000003

#define _SLEWCON_SYSDIV_POSITION                 0x00000010
#define _SLEWCON_SYSDIV_MASK                     0x000F0000
#define _SLEWCON_SYSDIV_LENGTH                   0x00000004

#define _CLKSTAT_FRCRDY_POSITION                 0x00000000
#define _CLKSTAT_FRCRDY_MASK                     0x00000001
#define _CLKSTAT_FRCRDY_LENGTH                   0x00000001

