MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAS169/mcu.h
#define _GLCDCLUT196_GREEN_POSITION              0x00000008
#define _GLCDCLUT196_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT196_GREEN_LENGTH                0x00000008

#define _GLCDCLUT196_RED_POSITION                0x00000010
#define _GLCDCLUT196_RED_MASK                    0x00FF0000
#define _GLCDCLUT196_RED_LENGTH                  0x00000008

#define _GLCDCLUT197_BLUE_POSITION               0x00000000
#define _GLCDCLUT197_BLUE_MASK                   0x000000FF
#define _GLCDCLUT197_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT197_GREEN_POSITION              0x00000008
#define _GLCDCLUT197_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT197_GREEN_LENGTH                0x00000008

#define _GLCDCLUT197_RED_POSITION                0x00000010
#define _GLCDCLUT197_RED_MASK                    0x00FF0000
#define _GLCDCLUT197_RED_LENGTH                  0x00000008

#define _GLCDCLUT198_BLUE_POSITION               0x00000000
#define _GLCDCLUT198_BLUE_MASK                   0x000000FF
#define _GLCDCLUT198_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT198_GREEN_POSITION              0x00000008
#define _GLCDCLUT198_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT198_GREEN_LENGTH                0x00000008

#define _GLCDCLUT198_RED_POSITION                0x00000010
#define _GLCDCLUT198_RED_MASK                    0x00FF0000
#define _GLCDCLUT198_RED_LENGTH                  0x00000008

#define _GLCDCLUT199_BLUE_POSITION               0x00000000
#define _GLCDCLUT199_BLUE_MASK                   0x000000FF
#define _GLCDCLUT199_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT199_GREEN_POSITION              0x00000008
#define _GLCDCLUT199_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT199_GREEN_LENGTH                0x00000008

#define _GLCDCLUT199_RED_POSITION                0x00000010
#define _GLCDCLUT199_RED_MASK                    0x00FF0000
#define _GLCDCLUT199_RED_LENGTH                  0x00000008

#define _GLCDCLUT200_BLUE_POSITION               0x00000000
#define _GLCDCLUT200_BLUE_MASK                   0x000000FF
#define _GLCDCLUT200_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT200_GREEN_POSITION              0x00000008
#define _GLCDCLUT200_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT200_GREEN_LENGTH                0x00000008

#define _GLCDCLUT200_RED_POSITION                0x00000010
#define _GLCDCLUT200_RED_MASK                    0x00FF0000
#define _GLCDCLUT200_RED_LENGTH                  0x00000008

#define _GLCDCLUT201_BLUE_POSITION               0x00000000
#define _GLCDCLUT201_BLUE_MASK                   0x000000FF
#define _GLCDCLUT201_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT201_GREEN_POSITION              0x00000008
#define _GLCDCLUT201_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT201_GREEN_LENGTH                0x00000008

#define _GLCDCLUT201_RED_POSITION                0x00000010
#define _GLCDCLUT201_RED_MASK                    0x00FF0000
#define _GLCDCLUT201_RED_LENGTH                  0x00000008

#define _GLCDCLUT202_BLUE_POSITION               0x00000000
#define _GLCDCLUT202_BLUE_MASK                   0x000000FF
#define _GLCDCLUT202_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT202_GREEN_POSITION              0x00000008
#define _GLCDCLUT202_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT202_GREEN_LENGTH                0x00000008

#define _GLCDCLUT202_RED_POSITION                0x00000010
#define _GLCDCLUT202_RED_MASK                    0x00FF0000
#define _GLCDCLUT202_RED_LENGTH                  0x00000008

#define _GLCDCLUT203_BLUE_POSITION               0x00000000
#define _GLCDCLUT203_BLUE_MASK                   0x000000FF
#define _GLCDCLUT203_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT203_GREEN_POSITION              0x00000008
#define _GLCDCLUT203_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT203_GREEN_LENGTH                0x00000008

#define _GLCDCLUT203_RED_POSITION                0x00000010
#define _GLCDCLUT203_RED_MASK                    0x00FF0000
#define _GLCDCLUT203_RED_LENGTH                  0x00000008

#define _GLCDCLUT204_BLUE_POSITION               0x00000000
#define _GLCDCLUT204_BLUE_MASK                   0x000000FF
#define _GLCDCLUT204_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT204_GREEN_POSITION              0x00000008
#define _GLCDCLUT204_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT204_GREEN_LENGTH                0x00000008

#define _GLCDCLUT204_RED_POSITION                0x00000010
#define _GLCDCLUT204_RED_MASK                    0x00FF0000
#define _GLCDCLUT204_RED_LENGTH                  0x00000008

#define _GLCDCLUT205_BLUE_POSITION               0x00000000
#define _GLCDCLUT205_BLUE_MASK                   0x000000FF
#define _GLCDCLUT205_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT205_GREEN_POSITION              0x00000008
#define _GLCDCLUT205_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT205_GREEN_LENGTH                0x00000008

#define _GLCDCLUT205_RED_POSITION                0x00000010
#define _GLCDCLUT205_RED_MASK                    0x00FF0000
#define _GLCDCLUT205_RED_LENGTH                  0x00000008

#define _GLCDCLUT206_BLUE_POSITION               0x00000000
#define _GLCDCLUT206_BLUE_MASK                   0x000000FF
#define _GLCDCLUT206_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT206_GREEN_POSITION              0x00000008
#define _GLCDCLUT206_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT206_GREEN_LENGTH                0x00000008

#define _GLCDCLUT206_RED_POSITION                0x00000010
#define _GLCDCLUT206_RED_MASK                    0x00FF0000
#define _GLCDCLUT206_RED_LENGTH                  0x00000008

#define _GLCDCLUT207_BLUE_POSITION               0x00000000
#define _GLCDCLUT207_BLUE_MASK                   0x000000FF
#define _GLCDCLUT207_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT207_GREEN_POSITION              0x00000008
#define _GLCDCLUT207_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT207_GREEN_LENGTH                0x00000008

#define _GLCDCLUT207_RED_POSITION                0x00000010
#define _GLCDCLUT207_RED_MASK                    0x00FF0000
#define _GLCDCLUT207_RED_LENGTH                  0x00000008

